---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
source: html/b13108e8-e02f-baed-76a0-05e2bf44df0f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.IsEqual Method

Compares two colored surface settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayColoredSurfaceSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings`) - Colored surface settings object to compare with.

## Returns
True if objects are equal, false otherwise.